{
  "articles": [
    {
      "id": 1,
      "title": "Feds charge 16 Russians allegedly tied to botnets used in cyberattacks and spying",
      "description": "An example of how a single malware operation can enable both criminal and state-sponsored hacking.",
      "content": "The hacker ecosystem in Russia, more than perhaps anywhere else in the world, has long blurred the lines between cybercrime, state-sponsored cyberwarfare, and espionage. Now an indictment of a group of Russian nationals and the takedown of their spra... [2316 chars]",
      "url": "https://arstechnica.com/security/2025/05/feds-charge-16-russians-allegedly-tied-to-botnets-used-in-cyberattacks-and-spying/",
      "image": "https://cdn.arstechnica.net/wp-content/uploads/2024/01/russia-state-hacking.jpg",
      "publishedAt": "2025-05-23T19:56:45Z",
      "author": "Ars Technica"
    },
    {
      "id": 2,
      "title": "Elon Musk insists he's not a 'Nazi' just 'because of some random hand gesture at a rally'",
      "description": "Billionaire Elon Musk pushed back on accusations that he was a Nazi sympathizer because of a hand gesture he made during one of President Donald Trump's rallies.In a Tuesday interview with CNBC, Musk accused the mainstream media of propaganda.\"What would an example of that be?\" CNBC's David Faber wo...",
      "content": "Billionaire Elon Musk pushed back on accusations that he was a Nazi sympathizer because of a hand gesture he made during one of President Donald Trump's rallies.\nIn a Tuesday interview with CNBC, Musk accused the mainstream media of propaganda.\n\"What... [723 chars]",
      "url": "https://www.rawstory.com/elon-musk-nazi-hand-gesture/",
      "image": "https://www.rawstory.com/media-library/file-photo-file-photo-tesla-ceo-and-x-owner-elon-musk-listens-as-us-president-elect-donald-trump-speaks-during-a-meeting-with.jpg?id=56137939&width=1200&height=600&coordinates=0%2C426%2C0%2C426",
      "publishedAt": "2025-05-20T23:17:35Z",
      "author": "Raw Story"
    },
    {
      "id": 3,
      "title": "Kevin Harvick Sets an Example for Roger Penske to Follow as Indy 500 Scandal Raises Questions",
      "description": "Kevin Harvick's no-nonsense approach to accountability in the CARS Tour offers a witty lesson for Roger Penske after the Indy 500 scandal",
      "content": "It seems like Team Penske can't seem to learn from their past mistakes. After facing the ire of the entire IndyCar community over the Push-to-Pass controversy last year, Team Penske has done it again. This time at the biggest stage, that has once aga... [5002 chars]",
      "url": "https://www.essentiallysports.com/nascar-news-kevin-harvick-sets-an-example-for-roger-penske-to-follow-as-indy-500-scandal-raises-questions/",
      "image": "https://image-cdn.essentiallysports.com/wp-content/uploads/Roger-Penske-Kevin-Harvick.jpg",
      "publishedAt": "2025-05-20T23:15:43Z",
      "author": "Essentially Sports"
    },
    {
      "id": 4,
      "title": "Never Seen Before? How This Airline Recently Had The \"Perfect Day\"",
      "description": "A rare example of perfect punctuality.",
      "content": "Punctuality is one of the key metrics when it comes to measuring an airline's performance. Defined as the percentage of flights that arrive at their destination within 15 minutes of the scheduled time, on-time performance (OTP) gives us a useful insi... [9207 chars]",
      "url": "https://simpleflying.com/never-seen-before-airline-perfect-day-otp/",
      "image": "https://static1.simpleflyingimages.com/wordpress/wp-content/uploads/2025/05/main-image-16_9-28.png",
      "publishedAt": "2025-05-20T23:00:16Z",
      "author": "Simple Flying"
    },
    {
      "id": 5,
      "title": "After a political career shaped by cancer, Biden faces his own grim diagnosis",
      "description": "The announcement that Joe Biden has prostate cancer is the latest example of how the final chapters of his political career have been shaped by the disease.",
      "content": "WASHINGTON (AP) — In Joe Biden's family, there's a saying that the three worst words anyone can hear are 'you have cancer.'\nOne decade ago, his son Beau died from a brain tumor. Several years later, his wife Jill had two cancerous lesions removed in ... [4425 chars]",
      "url": "https://apnews.com/article/joe-biden-prostate-cancer-diagnosis-e0cce67459403e192ba06aebb4db31ec",
      "image": "https://dims.apnews.com/dims4/default/89924ea/2147483647/strip/true/crop/3858x2170+0+201/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F76%2Fe3%2F33bdb8c8dfd1b6a6109a7f799882%2Fce80bcd0e138401f935d89e1d3ce1fc4",
      "publishedAt": "2025-05-19T22:22:06Z",
      "author": "The Associated Press"
    },
    {
      "id": 6,
      "title": "DeWalt's 20V Pruning Shears: What Size Branches Can It Cut Through?",
      "description": "DeWalt's battery-powered pruning shears are a perfect example of power tools to replace your hand tools with, making the job far less labor intensive.",
      "content": "We may receive a commission on purchases made from links.\nYou might think of DeWalt more for its home improvement tools, like power drills and mechanic sets, but there is no short supply of options when it comes to DeWalt outdoor power tools or lands... [1308 chars]",
      "url": "https://www.slashgear.com/1844235/dewalt-pruning-shears-size-branches-explained/",
      "image": "https://www.slashgear.com/img/gallery/dewalts-20v-pruning-shears-what-size-branches-can-it-cut-through/l-intro-1745580555.jpg",
      "publishedAt": "2025-05-19T20:45:00Z",
      "author": "SlashGear"
    },
    {
      "id": 7,
      "title": "Decades-old Windows systems are still running trains, printers, and hospitals",
      "description": "A new BBC report uncovers some of the strangest real-world cases where outdated versions of Windows are still powering critical systems. One example is a hospital elevator...",
      "content": "The big picture: There have been 15 Windows versions released over the last three decades, but even today, some of Microsoft's oldest works continue to hum away in the background. All over the world, ancient versions of Windows are still keeping elev... [2670 chars]",
      "url": "https://www.techspot.com/news/107960-decades-old-windows-systems-running-trains-printers-hospitals.html",
      "image": "https://www.techspot.com/images2/news/bigimage/2025/05/2025-05-18-image-5.jpg",
      "publishedAt": "2025-05-18T17:45:00Z",
      "author": "TechSpot"
    },
    {
      "id": 8,
      "title": "My husband's infuriating habit sets a bad example for our kids. I've asked them to police him.",
      "description": "He knows better than to try it when I'm around.",
      "content": "Care and Feeding is Slate's parenting advice column. Have a question for Care and Feeding? Submit it here.\nDear Care and Feeding,\nMy husband has an infuriating habit of parking in spaces reserved for people with disabilities. He knows better than to ... [6237 chars]",
      "url": "https://slate.com/advice/2025/05/family-advice-husband-bad-example-kids.html",
      "image": "https://compote.slate.com/images/034fb67f-7acb-450c-bef7-2365a9b67e49.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1560",
      "publishedAt": "2025-05-18T12:00:00Z",
      "author": "Slate"
    },
    {
      "id": 9,
      "title": "The right wing just committed a major blunder",
      "description": "Over the last several decades, few initiatives of the American political right have met with greater sustained success than the relentless crusade to capture control of the courts. The U.S. Supreme Court's reactionary majority is, of course, the ultimate and most visible example of this success, b...",
      "content": "Over the last several decades, few initiatives of the American political right have met with greater sustained success than the relentless crusade to capture control of the courts. The U.S. Supreme Court's reactionary majority is, of course, the ulti... [5202 chars]",
      "url": "https://www.rawstory.com/the-right-wing-just-committed-a-major-blunder/",
      "image": "https://www.rawstory.com/media-library/image.jpg?id=53776834&width=1200&height=600&coordinates=0%2C459%2C0%2C459",
      "publishedAt": "2025-05-17T14:47:36Z",
      "author": "Raw Story"
    },
    {
      "id": 10,
      "title": "Latin America's leftist leaders remember Uruguay's 'Pepe' Mujica as generous, charismatic leader",
      "description": "In the soaring palace of Uruguay's parliament, left-wing presidents from the region have come to remember former President Jose Mujica as a generous and charismatic leader whose legacy of humility remained an example for the world's politicians.",
      "content": "Brazil's President Luiz Inacio Lula Da Silva kisses Lucia Topolansky, widow of former Uruguayan President Jose Mujica, during funeral ceremonies for the late leader at the Legislative Palace in Montevideo, Uruguay, Thursday, May 15, 2025. (AP Photo/M... [2987 chars]",
      "url": "https://www.clickondetroit.com/news/world/2025/05/15/latin-americas-leftist-leaders-remember-uruguays-pepe-mujica-as-generous-charismatic-leader/",
      "image": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/P5HPTW2BBNALVNCRO2R6N64RTU.jpg?_a=DATAdteAZAA0",
      "publishedAt": "2025-05-15T21:46:12Z",
      "author": "WDIV ClickOnDetroit"
    },
    {
      "id": 11,
      "title": "Chrissy Teigen gets hairline lowered in shocking procedure",
      "description": "Chrissy Teigen revealed she had her hairline surgically lowered after alarming fans with her bandaged face on Instagram Live this week.",
      "content": "Chrissy Teigen revealed she got her hairline surgically lowered after alarming fans with her bandaged face on Instagram Live this week. At [sic] lot of you are wondering about my hospital pic which is very understandable as I gave no explanation lol... [2720 chars]",
      "url": "https://pagesix.com/2025/05/24/style/chrissy-teigen-gets-hairline-lowered-in-shocking-procedure/",
      "image": "https://pagesix.com/wp-content/uploads/sites/3/2025/05/105250732.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2025-05-24T20:43:00Z",
      "author": "Page Six"
    },
    {
      "id": 12,
      "title": "Impossible Opening Overseas Box Office",
      "description": "Early global and international box office numbers for Lilo & Stitch and Mission: Impossible - The Final Reckoning",
      "content": "Refresh for latest…: Big weekend at the global and international box office as Disney's Lilo & Stitch and Paramount/Skydance's Mission: Impossible - The Final Reckoning take center stage. Lilo & Stitch, the live-action take on 2002's animated adventu... [1839 chars]",
      "url": "https://deadline.com/2025/05/lilo-stitch-mission-impossible-box-office-global-opening-international-1236409506/",
      "image": "https://deadline.com/wp-content/uploads/2025/05/Lilo-Stitch-Mission-Impossible-The-Final-Reckoning.jpg?w=1024",
      "publishedAt": "2025-05-24T19:42:00Z",
      "author": "Deadline"
    },
    {
      "id": 13,
      "title": "Liberty rally for thrilling win over Catilin Clark, Fever to pass first test",
      "description": "Nastasha Cloud swatted the ball from Clark as time expired, securing the Liberty's 90-88 win at Gainsbridge Fieldhouse on Saturday afternoon.",
      "content": "INDIANAPOLIS - Boos and cheers rained down on Sabrina Ionescu as she stepped up to the free-throw line. Ionescu, a career 90.7 percent free-throw shooter, drained both shots to give the Liberty a two-point lead with 2.9 seconds left. Everyone knew wh... [2959 chars]",
      "url": "https://nypost.com/2025/05/24/sports/liberty-rally-for-thrilling-win-over-catilin-clark-fever-to-pass-first-test/",
      "image": "https://nypost.com/wp-content/uploads/sites/2/2025/05/newspress-collage-k6d2dr2m3-1748115263383.jpg?quality=75&strip=all&1748100904&w=1024",
      "publishedAt": "2025-05-24T19:39:00Z",
      "author": "New York Post"
    },
    {
      "id": 14,
      "title": "Hidden city built 140,000 years ago discovered at bottom of ocean",
      "description": "Buried beneath the sea off the coast of Indonesia, scientists have made a groundbreaking discovery that could rewrite the story of human origins.",
      "content": "Buried beneath the sea off the coast of Indonesia, scientists have made a groundbreaking discovery that could rewrite the story of human origins. The skull of Homo erectus, an ancient human ancestor, was discovered over 140,000 years after it was fir... [5309 chars]",
      "url": "https://www.dailymail.co.uk/sciencetech/article-14744379/Hidden-city-built-140-000-years-ago-discovered-bottom-ocean.html",
      "image": "https://i.dailymail.co.uk/1s/2025/05/23/22/98704809-0-image-a-45_1748035530057.jpg",
      "publishedAt": "2025-05-24T19:38:40Z",
      "author": "Daily Mail"
    },
    {
      "id": 15,
      "title": "Jafar Panahi It Was Just an Accident",
      "description": "A complete list of the 2025 Cannes Film Festival winners, including the Palme d'Or recipient, Jafar Panahi's It Was Just an Accident.",
      "content": "Dissident Iranian director Jafar Panahi has won the Palme d'Or for best film for It Was Just an Accident at the 78th Cannes international film festival. Panahi, who just a few years ago was imprisoned in Tehran and under a 20-year travel and work ban... [4950 chars]",
      "url": "https://www.hollywoodreporter.com/movies/movie-news/2025-cannes-film-festival-palme-dor-winners-1236228268/",
      "image": "https://www.hollywoodreporter.com/wp-content/uploads/2025/05/GettyImages-22168674591.jpg?w=1296&h=730&crop=1",
      "publishedAt": "2025-05-24T19:13:17Z",
      "author": "The Hollywood Reporter"
    },
    {
      "id": 16,
      "title": "Arsenal stun Barcelona to win the Women's Champions League",
      "description": "Arsenal lift the UEFA Women's Champions League with a 1-0 win that ended Barcelona's hopes of a three-peat.",
      "content": "Arsenal upset defending champions Barcelona 1-0 to win the Women's Champions League for a second time. Stina Blackstenius scored in the 75th minute after being set up by fellow second-half substitute Beth Mead in the final at the Estadio Jose Alvalad... [3685 chars]",
      "url": "https://www.aljazeera.com/sports/2025/5/24/arsenal-stun-barcelona-to-win-the-womens-champions-league",
      "image": "https://www.aljazeera.com/wp-content/uploads/2025/05/2025-05-24T183035Z_2084544773_UP1EL5O1EZT2W_RTRMADP_3_SOCCER-CHAMPIONS-ARS-BAR-REPORT-1748111673.jpg?resize=1920%2C1440",
      "publishedAt": "2025-05-24T19:01:45Z",
      "author": "Al Jazeera"
    },
    {
      "id": 17,
      "title": "Travis Kelce and Taylor Swift spotted on date night in Florida as popstar unwinds after Blake Lively drama",
      "description": "After Justin Baldoni withdrew the subpoenas of her and her law firm in his legal battle with Blake Lively, Swift relaxed with her NFL-star boyfriend at West Palm Beach restaurant Harry's.",
      "content": "Taylor Swift was seen enjoying a romantic meal with Travis Kelce in Florida on Friday night after her legal drama with former best friend Blake Lively came to an end. After Justin Baldoni withdrew the subpoenas of the singer and her law firm in his l... [4028 chars]",
      "url": "https://www.dailymail.co.uk/sport/nfl/article-14746369/travis-kelce-taylor-swift-date-florida-blake-lively.html",
      "image": "https://i.dailymail.co.uk/1s/2025/05/24/19/98721741-0-image-m-60_1748112808699.jpg",
      "publishedAt": "2025-05-24T18:56:32Z",
      "author": "Daily Mail"
    },
    {
      "id": 18,
      "title": "Jafar Panahi's It Was Just An Accident Wins Palme D'or",
      "description": "Cannes Film Festival 2025 Wwnners: Jafar Panahi's It Was Just an Accident takes Palme d'Or, Joachim Trier's Sentimental Value is Grand Prize",
      "content": "UPDATE: In a triumphant in-person return to the Cannes Film Festival, 22 years after he last attended (though some of his movies have screened in the intervening time), Iranian filmmaker Jafar Panahi was awarded the Palme d'Or this evening for It Was... [3839 chars]",
      "url": "https://deadline.com/2025/05/cannes-film-festival-2025-winners-full-list-1236410201/",
      "image": "https://deadline.com/wp-content/uploads/2025/05/GettyImages-2216119638.jpg?w=1024",
      "publishedAt": "2025-05-24T18:45:00Z",
      "author": "Deadline"
    },
    {
      "id": 19,
      "title": "Red Sox To Promote Marcelo Mayer",
      "description": "An injury to Alex Bregman gets Marcelo Mayer to the big leagues. Find out more about the Boston infield at MLB Trade Rumors.",
      "content": "The Red Sox are promoting top infield prospect Marcelo Mayer, reports ESPN's Jeff Passan. Katie Morrison-O'Day of MassLive observed that Mayer was being congratulated by his teammates in the clubhouse at Triple-A Worcester. Her MassLive colleague Chr... [4420 chars]",
      "url": "https://www.mlbtraderumors.com/2025/05/red-sox-to-promote-marcelo-mayer.html",
      "image": "https://cdn.mlbtraderumors.com/files/2025/05/USATSI_25660280-1024x733.jpg",
      "publishedAt": "2025-05-24T18:42:53Z",
      "author": "MLB Trade Rumors"
    },
    {
      "id": 20,
      "title": "Arsenal 1-0 Barcelona (May 24, 2025) Game Analysis",
      "description": "Expert recap and game analysis of the Arsenal vs. Barcelona Uefa Women's Champions League game from May 24, 2025 on ESPN.",
      "content": "Take a look at the numbers behind Arsenal's 1-0 victory over Barcelona to win the Women's Champions League for the first time in 18 years. Arsenal forward Stina Blackstenius struck a late winner as the north London team shocked holders Barcelona 1-0 ... [1019 chars]",
      "url": "https://www.espn.com/soccer/report/_/gameId/735085",
      "image": "https://a.espncdn.com/combiner/i?img=/i/espn/misc_logos/500/soccer.png",
      "publishedAt": "2025-05-24T18:11:15Z",
      "author": "ESPN"
    },
    {
      "id": 21,
      "title": "Senate's Vote Against CA Law Sets Up Legal Battle",
      "description": "The Senate has upended California's ambitious plan to phase out new gasoline cars, igniting a nationwide legal fight that could redefine the future of electric vehicles...",
      "content": "The Senate has upended California's ambitious plan to phase out new gasoline cars, igniting a nationwide legal fight that could redefine the future of electric vehicles for about 40% of the US auto market, the New York Times reports. Thursday's vote ... [1921 chars]",
      "url": "https://www.newser.com/story/369119/senates-vote-against-ca-law-sets-up-legal-battle.html",
      "image": "https://img1-azrcdn.newser.com/image/1612216-12-20250523010502.jpeg",
      "publishedAt": "2025-05-23T10:35:00Z",
      "author": "Newser"
    },
    {
      "id": 22,
      "title": "Android Automotive is expanding its app catalog for cars with the largest displays",
      "description": "Google has announced that it's working on improving the large-screen app experience for Android Automotive.",
      "content": "Damien Wilde / Android Authority TL;DR Google is working on additional mobile app compatibility for large screens in Android Automotive. There's a new aspect ratio menu that allows you to switch between the default and full screen. This compatibility... [1546 chars]",
      "url": "https://www.androidauthority.com/android-automotive-large-screen-app-compatibility-3560588/",
      "image": "https://www.androidauthority.com/wp-content/uploads/2024/01/Android-Auto-EV-charging-in-Google-Maps.jpg",
      "publishedAt": "2025-05-22T20:49:46Z",
      "author": "Android Authority"
    },
    {
      "id": 23,
      "title": "Music talent agency says 3 employees died in San Diego plane crash",
      "description": "A private jet crashed into military housing in San Diego during foggy weather early Thursday, igniting cars parked along a suburban neighborhood block and killing multiple people on board the plane, authorities said.",
      "content": "SAN DIEGO — The music agency Sound Talent Group said Thursday that three of its employees, including co-founder Dave Shapiro, died on the private plane that crashed into a San Diego neighborhood. Shapiro is listed as the owner of the plane and has a ... [6028 chars]",
      "url": "https://www.chicagotribune.com/2025/05/22/plane-crash-san-diego/",
      "image": "https://www.chicagotribune.com/wp-content/uploads/2025/05/AP25142508831978.jpg?w=1024&h=683",
      "publishedAt": "2025-05-22T13:15:49Z",
      "author": "Chicago Tribune"
    },
    {
      "id": 24,
      "title": "Penske fires president Tim Cindric, two others after Indy 500 penalties",
      "description": "Team Penske fired team president Tim Cindric, managing director Ron Ruzewski and general manager Kyle Moyer after two Penske cars were deemed illegal ahead of the 2025 Indianapolis 500, Roger Penske announced Wednesday.",
      "content": "Roger Penske, whose company owns Team Penske, IndyCar, the Indianapolis Motor Speedway and the Indianapolis 500, fired three members of his leadership team Wednesday. File Photo by Mike Gentry/UPI | License Photo May 21 (UPI) -- Team Penske fired tea... [1655 chars]",
      "url": "https://www.upi.com/Sports_News/2025/05/21/Penske-fires-president-Tim-Cindric-IndyCar-scandal/7841747848158/",
      "image": "https://cdnph.upi.com/sv/ph/og/upi/7841747848158/2025/1/342da043038881fb74a94574428d70b0/v1.5/Penske-fires-president-Tim-Cindric-two-others-after-Indy-500-penalties.jpg",
      "publishedAt": "2025-05-21T18:48:26Z",
      "author": "UPI News"
    },
    {
      "id": 25,
      "title": "Volvo Puts Gemini In The Passenger Seat As Google Accelerates Android Auto",
      "description": "Volvo Cars and Google have announced a partnership that seeks to change in-car digital experiences for the better. New Volvo models equipped with Android Auto will soon be the first cars to have Gemini AI.",
      "content": "Volvo Cars and Google have announced a partnership that seeks to change in-car digital experiences for the better. New Volvo models equipped with Android Auto will soon be the first cars to have Gemini AI. The vision is to have a cabin where drivers ... [1296 chars]",
      "url": "https://hothardware.com/news/volvo-puts-gemini-in-the-passenger-seat-as-google-accelerates-android-auto",
      "image": "https://images.hothardware.com/contentimages/newsitem/67607/content/hero-ex90.jpg",
      "publishedAt": "2025-05-21T15:36:00Z",
      "author": "Hot Hardware"
    },
    {
      "id": 26,
      "title": "Google's Gemini AI is coming to Volvo cars",
      "description": "The two companies announced the partnership at Google's annual I/O developer conference",
      "content": "Google (GOOGL-1.57% ) is bringing its Gemini AI to Volvo cars. Google parent Alphabet and the Swedish carmaker, two companies that have collaborated for decades, announced a new partnership Wednesday to use Volvo's vehicles as the lead development pa... [1913 chars]",
      "url": "https://qz.com/google-gemini-ai-volvo-partnership-1851781685",
      "image": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/254e9cd0cb86b5a65f890f6a07520182.jpg",
      "publishedAt": "2025-05-21T14:17:00Z",
      "author": "Quartz India"
    },
    {
      "id": 27,
      "title": "Kevin Harvick Sets an Example for Roger Penske to Follow as Indy 500 Scandal Raises Questions",
      "description": "Kevin Harvick's no-nonsense approach to accountability in the CARS Tour offers a witty lesson for Roger Penske after the Indy 500 scandal",
      "content": "It seems like Team Penske can't seem to learn from their past mistakes. After facing the ire of the entire IndyCar community over the Push-to-Pass controversy last year, Team Penske has done it again. This time at the biggest stage, that has once aga... [5002 chars]",
      "url": "https://www.essentiallysports.com/nascar-news-kevin-harvick-sets-an-example-for-roger-penske-to-follow-as-indy-500-scandal-raises-questions/",
      "image": "https://image-cdn.essentiallysports.com/wp-content/uploads/Roger-Penske-Kevin-Harvick.jpg",
      "publishedAt": "2025-05-20T23:15:43Z",
      "author": "Essentially Sports"
    },
    {
      "id": 28,
      "title": "10 A-Body GM Muscle Cars That Are Worth Remembering",
      "description": "GM's A-body platform arrived in time to participate in the muscle car revolution. Some became legends, but those that didn't are still worth remembering.",
      "content": "GM's intermediate-sized A-body platform formed the basis for some of the most well-loved models of the 1960s and 1970s, including some of the classics of the muscle car era. Its legendary run lasted for decades until it was replaced with the G-body p... [1568 chars]",
      "url": "https://www.slashgear.com/1860402/best-gm-a-body-muscle-cars/",
      "image": "https://www.slashgear.com/img/gallery/10-a-body-gm-muscle-cars-that-are-worth-remembering/l-intro-1747296198.jpg",
      "publishedAt": "2025-05-20T18:30:00Z",
      "author": "SlashGear"
    },
    {
      "id": 29,
      "title": "Not so Penske Perfect: Indy 500 rocked by another cheating scandal by marquee team",
      "description": "Team Penske has been rocked by a second cheating scandal in just over a year. The cars of Josef Newgarden and Will Power were found to have illegal modifications and were disqualified from qualifying, meaning they will star at the back of the field.",
      "content": "INDIANAPOLIS (AP) — As the latest round of Team Penske cheating allegations swirled through Indianapolis Motor Speedway, the president of the IndyCar team stood outside the garage to address the illegal modifications discovered on two of its cars. Lu... [6584 chars]",
      "url": "https://apnews.com/article/indy-500-penske-cheating-f1bc3f7f6de678cb45b547987828c4a1",
      "image": "https://dims.apnews.com/dims4/default/55250c4/2147483647/strip/true/crop/7322x4119+0+382/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F76%2Fb53b9085abb21b5c4e0be76db465%2Ff01951f5f02148f5b7688b3f9d0b51fd",
      "publishedAt": "2025-05-20T00:20:24Z",
      "author": "The Associated Press"
    },
    {
      "id": 30,
      "title": "Yes, Your Car May Have A Key Fob Holder That You Never Knew About",
      "description": "Common places to store key fobs for keyless cars include the cupholder or dedicated cubbies hidden around the vehicle cockpit.",
      "content": "Technology in the automotive world moves pretty fast, whether it be breakthroughs in innovative engine designs, automakers pioneering exciting new alternative fuels, or simply little tweaks that improve the everyday driving experience. One piece of t... [1010 chars]",
      "url": "https://www.slashgear.com/1860155/car-key-fob-cup-holder-never-knew-about/",
      "image": "https://www.slashgear.com/img/gallery/yes-your-car-may-have-a-key-fob-holder-that-you-never-knew-about/l-intro-1746614794.jpg",
      "publishedAt": "2025-05-19T22:15:00Z",
      "author": "SlashGear"
    },
    {
      "id": 31,
      "title": "Why Shai Gilgeous-Alexander winning MVP makes him the best NBA player to play for John Calipari at Kentucky",
      "description": "The OKC star became the first Kentucky basketball player to win NBA MVP",
      "content": "Kentucky basketball is synonymous with college basketball royalty. In UK's storied history, the program has produced 60 first-round NBA Draft picks. Thirty-seven of those selections occurred during the John Calipari era, which spanned from 2009 to la... [4112 chars]",
      "url": "https://www.cbssports.com/college-basketball/news/why-shai-gilgeous-alexander-winning-mvp-makes-him-the-best-nba-player-to-play-for-john-calipari-at-kentucky/",
      "image": "https://sportshub.cbsistatic.com/i/r/2025/05/22/d30199b9-0698-473b-81db-c9dda44606d4/thumbnail/1200x675/2c423d42db74cb1b35dd7614608b105a/sga-x-cal-getty.png",
      "publishedAt": "2025-05-22T14:38:00Z",
      "author": "CBS Sports"
    },
    {
      "id": 32,
      "title": "Meet NBA's newest rivalry",
      "description": "This is Brunson vs. Haliburton just as much as it's Knicks vs. Pacers — and it has the makings of a good ole-fashioned basketball rivalry.",
      "content": "It's the matchup Tyrese Haliburton wanted — one-on-one with the Knicks captain — and with just under five minutes left in the third quarter of Game 1 of the Eastern Conference Finals matchup between the Knicks and Pacers, Indiana's All-Star guard dia... [7060 chars]",
      "url": "https://www.nydailynews.com/2025/05/21/knicks-jalen-brunson-tyrese-haliburton-nba-pacers-eastern-conference-finals/",
      "image": "https://www.nydailynews.com/wp-content/uploads/2025/05/AP24132041324790-1.jpg?w=1024&h=576",
      "publishedAt": "2025-05-22T03:39:46Z",
      "author": "New York Daily News"
    },
    {
      "id": 33,
      "title": "Doug Gottlieb, Green Bay land 28-year-old transfer Ramel Bethea, likely oldest Division I player for 2025-26",
      "description": "Ramel Bethea spent five years in the military before starting his college basketball career",
      "content": "Doug Gottlieb and Green Bay may have landed the oldest player in Division I college basketball for the 2025-26 season with 28-year-old Ramel Bethea committing to the Phoenix. The 6-foot-9 big man turns 29 in July — older than NBA MVP favorite Shai Gi... [2276 chars]",
      "url": "https://www.cbssports.com/college-basketball/news/doug-gottlieb-green-bay-land-28-year-old-transfer-ramel-bethea-likely-oldest-division-i-player-for-2025-26/",
      "image": "https://sportshub.cbsistatic.com/i/r/2025/05/21/e4ba872f-e5d9-4c7c-9320-2488275dd9c9/thumbnail/1200x675/ce6f8bf1dd549c0262c82c97c89ce2e1/ramelbethea.jpg",
      "publishedAt": "2025-05-21T20:04:16Z",
      "author": "CBS Sports"
    },
    {
      "id": 34,
      "title": "Kansas basketball hires former NBA star, coach Jacque Vaughn as assistant under Bill Self",
      "description": "This would be Vaughn's first role in college coaching",
      "content": "Former NBA star and coach Jacque Vaughn is taking his talents to college basketball. Kansas is set to hire the two-time NBA head coach as an assistant basketball coach, according to ESPN. Kansas head coach Bill Self had a role to fill with the retire... [1369 chars]",
      "url": "https://www.cbssports.com/college-basketball/news/kansas-basketball-hires-former-nba-star-coach-jacque-vaughn-as-assistant-under-bill-self/",
      "image": "https://sportshub.cbsistatic.com/i/r/2020/07/02/5357cc4a-8070-4b88-af03-324d208b889f/thumbnail/1200x675/b6db33182895e2d61dcb8b17153ea52b/jacque-vaughn.jpg",
      "publishedAt": "2025-05-21T19:51:00Z",
      "author": "CBS Sports"
    },
    {
      "id": 35,
      "title": "College basketball rankings: Florida lands Arkansas' Boogie Fland, makes big jump in updated Top 25 And 1",
      "description": "The reigning NCAA champs are No. 6 in the early preseason rankings",
      "content": "1 Houston This ranking is based on the Cougars returning three of the top seven scorers -- specifically Emanuel Sharp, Milos Uzan and Joseph Tugler -- from a team that finished 35-5 and advanced to the championship game of the 2025 NCAA Tournament. T... [12424 chars]",
      "url": "https://www.cbssports.com/college-basketball/news/college-basketball-rankings-florida-lands-arkansas-boogie-fland-makes-big-jump-in-updated-top-25-and-1/",
      "image": "https://sportshub.cbsistatic.com/i/r/2025/05/20/6b81e3da-96f7-4011-a1e9-eeaf980458b3/thumbnail/1200x675/9dfa25f06ae2945583d02c0321a472da/floridatop25and1.jpg",
      "publishedAt": "2025-05-20T21:28:00Z",
      "author": "CBS Sports"
    },
    {
      "id": 36,
      "title": "Sumter Police call on public to locate missing man with dementia",
      "description": "Kenneth Wayne Cox, who stands 5 tall and weighs about 170 lbs., was last seen wearing gray basketball shorts and a red and white plaid shirt.",
      "content": "Police say 67-year-old Kenneth Wayne Cox was reported missing from the The Gardens in the McCray's Mill Road area around 2:45 p.m. Tuesday. SUMTER, S.C. — Sumter Police are asking for the public's help to find a missing, vulnerable man. Police say 67... [339 chars]",
      "url": "https://www.wltx.com/article/news/local/street-squad/sumter/missing-sumter-man-kenneth-wayne-cox/101-4f516363-cfda-4d79-8e74-3139d52f593c",
      "image": "https://media.wltx.com/assets/WLTX/images/c7697602-7c0b-4abe-b3d3-134c19dae0e4/20250520T202245/c7697602-7c0b-4abe-b3d3-134c19dae0e4_1140x641.jpg",
      "publishedAt": "2025-05-20T20:32:36Z",
      "author": "WLTX.com"
    },
    {
      "id": 37,
      "title": "Florida pays up in transfer portal for top returning guard in men's college basketball",
      "description": "One of the biggest names left in the transfer portal is no longer on the board.",
      "content": "The reigning national champion Florida Gators dramatically bolstered their chances of going back-to-back by adding transfer guard Boogie Fland from Arkansas on Tuesday. The 6 Fland had been going through the NBA Draft process before announcing last... [2086 chars]",
      "url": "https://www.sbnation.com/college-basketball/2025/5/20/24433936/florida-transfer-portal-mens-college-basketball-boogie-fland-nil-payment",
      "image": "https://cdn.vox-cdn.com/thumbor/Q9YIR57N4oWdSe84tMBtO71VMfA=/0x0:3600x1885/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/26001214/2207493882.jpg",
      "publishedAt": "2025-05-20T17:32:34Z",
      "author": "SB Nation"
    },
    {
      "id": 38,
      "title": "Notre Dame hires alum Pat Garrity to trailblazing role overseeing both men's and women's basketball teams",
      "description": "The 1998 ND alumnus will be the general manager for both programs, as Notre Dame readies for the next major phase of college athletics",
      "content": "Notre Dame has hired alum Pat Garrity in a trailblazing new role for its men's and women's basketball teams, sources told CBS Sports. The 1998 graduate and former NBA player will be the general manager for both programs, in addition overseeing men's ... [3591 chars]",
      "url": "https://www.cbssports.com/college-basketball/news/notre-dame-hires-alum-pat-garrity-to-trailblazing-role-overseeing-both-mens-and-womens-basketball-teams/",
      "image": "https://sportshub.cbsistatic.com/i/r/2025/05/20/592e3c94-f6f5-4fb0-9419-b01b10417a28/thumbnail/1200x675/d2b97e7dcfda2ebbc7a6847c16b26eea/patgarritynotredamegm-1.jpg",
      "publishedAt": "2025-05-20T14:53:00Z",
      "author": "CBS Sports"
    },
    {
      "id": 39,
      "title": "WCC All-Freshman commits to Mizzou Women's Basketball",
      "description": "Pepperdine transfer Chloe Sotell announced her commitment to head coach Kellie Harper and her staff on Monday afternoon, per a post on her Instagram page.",
      "content": "COLUMBIA, Mo. (KMIZ) Mizzou Women's Basketball has added a young talent to its veteran-led roster. Pepperdine transfer Chloe Sotell announced her commitment to head coach Kellie Harper and her staff on Monday afternoon, per a post on her Instagram pa... [1348 chars]",
      "url": "https://abc17news.com/sports/mizzou-tigers/mizzou-womens-basketball/2025/05/19/wcc-all-freshman-commits-to-mizzou-womens-basketball/",
      "image": "https://abc17news.b-cdn.net/abc17news.com/2025/05/WEB-3.jpg",
      "publishedAt": "2025-05-19T23:56:19Z",
      "author": "ABC17News.com"
    },
    {
      "id": 40,
      "title": "What Brad Stevens said about Celtics' Cooper Flagg interview",
      "description": "Celtics president of basketball operations Brad Stevens was asked about the team's reported interview with Cooper Flagg.",
      "content": "Celtics What Brad Stevens said about the Celtics' reported Cooper Flagg interview The Celtics reportedly interviewed Flagg at the combine. Cooper Flagg Photo by Michael Reaves/Getty Images Maine native Cooper Flagg, who grew up watching tapes of the ... [2778 chars]",
      "url": "https://www.boston.com/sports/boston-celtics/2025/05/19/brad-stevens-cooper-flagg-celtics-nba-draft-comments-quotes/",
      "image": "https://bdc2020.o0bc.com/wp-content/uploads/2025/05/VFAKEHLNFBFGJGZNA6OI35PSEA-682bb1bbb459d-768x432.jpg",
      "publishedAt": "2025-05-19T23:37:28Z",
      "author": "Boston.com"
    }
  ]
}
